Revit 2027 API
FabricationPartBrowserChangedEventArgs.GetFilteredSolutionsPartsTypeCounts Method
 Returns the active fabrication part type usage count in fitlered routing solutions.
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IDictionary<ElementId, int> GetFilteredSolutionsPartsTypeCounts()
Public Function GetFilteredSolutionsPartsTypeCounts As IDictionary(Of ElementId, Integer)
public:
IDictionary<ElementId^, int>^ GetFilteredSolutionsPartsTypeCounts()
member GetFilteredSolutionsPartsTypeCounts : unit -> IDictionary<ElementId, int>
Return Value
IDictionary<ElementId, Int32>
See Also
Reference
FabricationPartBrowserChangedEventArgs Class
Autodesk.Revit.UI.Events Namespace